<?php

/**
 * This file is part of the CodeIgniter 4 framework.
 *
 * (c) CodeIgniter Foundation <admin@codeigniter.com>
 *
 * For the full copyright and license information, please view
 * the LICENSE file that was distributed with this source code.
 */

// Images language settings
return [
	'sourceImageRequired'    => 'നിങ്ങളുടെ മുൻ‌ഗണനകളിൽ ഒരു ഉറവിട ചിത്രം വ്യക്തമാക്കണം.',
	'gdRequired'             => 'ഈ സവിശേഷത ഉപയോഗിക്കുന്നതിന് ജിഡി ഇമേജ് ലൈബ്രറി ആവശ്യമാണ്.',
	'gdRequiredForProps'     => 'ഇമേജ് സവിശേഷതകൾ നിർണ്ണയിക്കാൻ നിങ്ങളുടെ സെർവർ ജിഡി ഇമേജ് ലൈബ്രറിയെ പിന്തുണയ്‌ക്കണം.',
	'gifNotSupported'        => 'ലൈസൻസിംഗ് നിയന്ത്രണങ്ങൾ കാരണം GIF ഇമേജുകൾ പലപ്പോഴും പിന്തുണയ്ക്കുന്നില്ല. പകരം നിങ്ങൾക്ക് JPG അല്ലെങ്കിൽ PNG ഇമേജുകൾ ഉപയോഗിക്കേണ്ടിവരും.',
	'jpgNotSupported'        => 'JPG ഇമേജുകൾ പിന്തുണയ്‌ക്കുന്നില്ല.',
	'pngNotSupported'        => 'പി‌എൻ‌ജി ചിത്രങ്ങൾ‌ പിന്തുണയ്‌ക്കുന്നില്ല.',
	'fileNotSupported'       => 'നൽകിയ ഫയൽ പിന്തുണയ്‌ക്കുന്ന ഇമേജ് തരമല്ല.',
	'unsupportedImageCreate' => 'ഇത്തരത്തിലുള്ള ഇമേജ് പ്രോസസ്സ് ചെയ്യുന്നതിന് ആവശ്യമായ ജിഡി ഫംഗ്ഷനെ നിങ്ങളുടെ സെർവർ പിന്തുണയ്ക്കുന്നില്ല.',
	'jpgOrPngRequired'       => 'നിങ്ങളുടെ മുൻ‌ഗണനകളിൽ വ്യക്തമാക്കിയ ഇമേജ് വലുപ്പം മാറ്റൽ പ്രോട്ടോക്കോൾ JPEG അല്ലെങ്കിൽ PNG ഇമേജ് തരങ്ങളിൽ മാത്രമേ പ്രവർത്തിക്കൂ.',
	'rotateUnsupported'      => 'ഇമേജ് റൊട്ടേഷൻ നിങ്ങളുടെ സെർവർ പിന്തുണയ്ക്കുന്നതായി തോന്നുന്നില്ല.',
	'libPathInvalid'         => 'നിങ്ങളുടെ ഇമേജ് ലൈബ്രറിയിലേക്കുള്ള പാത ശരിയല്ല. നിങ്ങളുടെ ഇമേജ് മുൻ‌ഗണനകളിൽ ശരിയായ പാത്ത് സജ്ജമാക്കുക. {0, string)',
	'imageProcessFailed'     => 'ഇമേജ് പ്രോസസ്സിംഗ് പരാജയപ്പെട്ടു. തിരഞ്ഞെടുത്ത പ്രോട്ടോക്കോളിനെ നിങ്ങളുടെ സെർവർ പിന്തുണയ്ക്കുന്നുവെന്നും നിങ്ങളുടെ ഇമേജ് ലൈബ്രറിയിലേക്കുള്ള പാത ശരിയാണെന്നും ദയവായി പരിശോധിക്കുക. ',
	'rotationAngleRequired'  => 'ചിത്രം തിരിക്കാൻ ഭ്രമണത്തിന്റെ ഒരു ആംഗിൾ ആവശ്യമാണ്.',
	'invalidPath'            => 'ചിത്രത്തിലേക്കുള്ള പാത ശരിയല്ല.',
	'copyFailed'             => 'ഇമേജ് കോപ്പി പതിവ് പരാജയപ്പെട്ടു.',
	'missingFont'            => 'ഉപയോഗിക്കാൻ ഒരു ഫോണ്ട് കണ്ടെത്താനായില്ല.',
	'saveFailed'             => 'ചിത്രം സംരക്ഷിക്കാനായില്ല. ചിത്രവും ഫയൽ ഡയറക്ടറിയും എഴുതാനാകുമെന്ന് ഉറപ്പാക്കുക.',
	'invalidDirection'       => 'ഫ്ലിപ്പ് ദിശ `vertical` അല്ലെങ്കിൽ `horizontal` മായി മാത്രമേ ആകാവൂ. നൽകിയിരിക്കുന്നത്: {0}',
	'exifNotSupported'       => 'എക്സിഫ് ഡാറ്റ വായിക്കുന്നത് ഈ പി‌എച്ച്പി ഇൻസ്റ്റാളേഷൻ പിന്തുണയ്ക്കുന്നില്ല.',
];
