<?php

/**
 * This file is part of CodeIgniter 4 framework.
 *
 * (c) CodeIgniter Foundation <admin@codeigniter.com>
 *
 * For the full copyright and license information, please view
 * the LICENSE file that was distributed with this source code.
 */

// Images language settings
return [
    'sourceImageRequired'    => 'നിങ്ങളുടെ തിരഞ്ഞെടുപ്പിൽ നിങ്ങൾ ഒരു ഉറവിട ചിത്രം വ്യക്തമാക്കണം. ',
    'gdRequired'             => 'ഈ സവിശേഷത GD ഇമേജ് ലൈബ്രറി ഉപയോഗിക്കേണ്ടതുണ്ട്. ',
    'gdRequiredForProps'     => 'ചിത്രത്തിന്റെ സവിശേഷതകൾ നിർണ്ണയിക്കാൻ നിങ്ങളുടെ സെർവർ ജിഡി ഇമേജ് ലൈബ്രറിയെ പിന്തുണയ്ക്കണം. ',
    'gifNotSupported'        => 'ലൈസൻസിംഗ് നിയന്ത്രണങ്ങൾ കാരണം GIF ചിത്രങ്ങൾ പലപ്പോഴും പിന്തുണയ്ക്കുന്നില്ല.പകരം നിങ്ങൾ ജെപിജി അല്ലെങ്കിൽ പിഎൻജി ചിത്രങ്ങൾ ഉപയോഗിക്കേണ്ടതുണ്ട്. ',
    'jpgNotSupported'        => 'ജെപിജി ചിത്രത്തിൽ പിന്തുണയ്ക്കുന്നില്ല. ',
    'pngNotSupported'        => 'പിഎൻജി ചിത്രത്തിൽ പിന്തുണയ്ക്കുന്നില്ല. ',
    'webpNotSupported'       => 'വെബ് ചിത്രം പിന്തുണയ്ക്കുന്നില്ല. ',
    'fileNotSupported'       => 'നൽകിയ ഫയൽ ഇമേജുള്ള തരത്തിലുള്ളതല്ല. ',
    'unsupportedImageCreate' => 'ഇത്തരത്തിലുള്ള ഇമേജ് പ്രോസസ്സ് ചെയ്യുന്നതിന് ആവശ്യമായ ജിഡി പ്രവർത്തനത്തെ നിങ്ങളുടെ സെർവർ പിന്തുണയ്ക്കുന്നില്ല. ',
    'jpgOrPngRequired'       => 'നിങ്ങളുടെ ചോയിസിൽ വ്യക്തമാക്കിയ ഇമേജ് പ്രതിരോധിച്ച പ്രോട്ടോക്കോൾ jpeg അല്ലെങ്കിൽ png ഇമേജ് തരത്തിൽ മാത്രമേ പ്രവർത്തിക്കൂ. ',
    'rotateUnsupported'      => 'ചിത്രത്തിന്റെ ഭ്രമണം നിങ്ങളുടെ സെർവർ പിന്തുണയ്ക്കുന്നില്ല. ',
    'libPathInvalid'         => 'നിങ്ങളുടെ ഇമേജ് ലൈബ്രറിയിലേക്കുള്ള പാത ശരിയല്ല.നിങ്ങളുടെ ഇമേജ് ചോയിസിലേക്ക് ശരിയായ പാത സജ്ജമാക്കുക.{0} ',
    'imageProcessFailed'     => 'ഇമേജ് പ്രോസസ്സിംഗ് പരാജയപ്പെട്ടു.നിങ്ങളുടെ സെർവർ തിരഞ്ഞെടുത്ത പ്രോട്ടോക്കോളിനെയും നിങ്ങളുടെ ഇമേജ് ലൈബ്രറിയിലേക്കുള്ള പാത ശരിയാണെന്ന് സ്ഥിരീകരിക്കുക. ',
    'rotationAngleRequired'  => 'തിരിക്കാൻ ഒരു റൊട്ടേഷൻ ആംഗിൾ തിരിക്കാൻ ചിത്രം ആവശ്യമാണ്. ',
    'invalidPath'            => 'ചിത്രത്തിന്റെ പാത ശരിയല്ല. ',
    'copyFailed'             => 'ഫോട്ടോയുടെ ഫോട്ടോയുടെ പതിവ് പരാജയപ്പെട്ടു. ',
    'missingFont'            => 'ഉപയോഗത്തിനായി ഒരു ഫോണ്ട് കണ്ടെത്താൻ കഴിഞ്ഞില്ല. ',
    'saveFailed'             => 'ചിത്രം സംരക്ഷിക്കാൻ കഴിയില്ല.ചിത്രവും ഫയൽ ഡയറക്ടറിയും എഴുതാൻ മൂല്യമുള്ളതാണെന്ന് ഉറപ്പാക്കുക.',
    'invalidDirection'       => 'വിപരീത ദിശ ലംബ അല്ലെങ്കിൽ തിരശ്ചീന മാത്രമേ ഉണ്ടാകൂ.നൽകിയിട്ടുണ്ട്: {0} ',
    'exifNotSupported'       => 'ഈ പിഎച്ച്പി ഈ പിഎച്ച്പിയെ പിന്തുണയ്ക്കുന്നില്ല.',
];
